Repository: ontiuk/iPressST
Catalog: languages/*.po
Languages: fi, sv_se

source: Author: <span class="post-author">%s</span>
fi: Kirjailija: <span class="post-author">%s</span>
sv_se: Författare: <span class="post-author">%s</span>

source: Category: %s
fi: Kategoria: %s
sv_se: Kategori: %s

source: Post Comments
fi: Lähetä kommentit
sv_se: Skicka kommentarer

# comments title
source: One comment on &ldquo;%s&rdquo;
fi: Yksi kommentti &ldquo;%s&rdquo;
sv_se: En tanke på &ldquo;%s&rdquo;

# Comments title
source: %s comment
fi: %s kommentoi
sv_se: %s kommentar

source: Leave a comment.
fi: Jätä kommentti.
sv_se: Lämna en kommentar.

source: Newer Comments
fi: Uudemmat Kommentit
sv_se: Nyare Kommentarer

source: Older Comments
fi: Vanhemmat Kommentit
sv_se: Äldre Kommentarer

source: Comments
fi: Kommentit
sv_se: Kommentarer

source: Comments are closed.
fi: Kommenttien lisääminen on estetty.
sv_se: Kommentarer är stängda.

# Search results count
source: Search: No Results for <span class="search-query">%1$s</span>
fi: Haku: Ei tuloksia haulle <span class="search-query">%1$s</span>
sv_se: Sök: Inga resultat för <span class="search-query">%1$s</span>

# Search results count
source: Search: %1$s Result for <span class="search-query">%2$s</span>
fi: Haku: %1$s Tulokset haulle <span class="search-query">%2$s</span>
sv_se: Sökning: %1$s Resultat för <span class="search-query">%2$s</span>

# Search label
source: Search for:
fi: Etsiä:
sv_se: Söka efter:

# placeholder
source: Search &hellip;
fi: Hae &hellip;
sv_se: Sök &hellip;

# Submit button
source: Search
fi: Hae
sv_se: Sök

source: Tag: %s
fi: Lappu: %s
sv_se: Märka: %s

source: Taxonomy: %1$s: %2$s
fi: Taksonomia: %1$s: %2$s
sv_se: Taxonomi: %1$s: %2$s

source: Primary Menu
fi: Päävalikko
sv_se: Primärmeny

source: Image in Post
fi: Kuva postitse
sv_se: Bild i posten

source: Original size
fi: Alkuperäinen koko
sv_se: Originalstorlek

source: Primary Sidebar
fi: Ensisijainen sivupalkki
sv_se: Primär sidofält

source: This is the primary sidebar.
fi: Tämä on ensisijainen sivupalkki.
sv_se: Detta är det primära sidofältet.

source: Header Sidebar
fi: Otsikon sivupalkki
sv_se: Sidofält i sidhuvudet

source: This is the header sidebar.
fi: Tämä on otsikon sivupalkki.
sv_se: Detta är sidofältet i sidhuvudet.

source: Shop Page Sidebar
fi: Kauppasivun sivupalkki
sv_se: Butikskategori Sidofält

source: This is the shop page sidebar for all layouts.
fi: Tämä on kauppasivun sivupalkki kaikille asetteluille.
sv_se: Detta är butiksidans sidofält för alla layouter.

source: Shop Product Page Sidebar
fi: Osta tuotesivun sivupalkki
sv_se: Handla produktsidans sidofält

source: This is the shop product page sidebar for all layouts.
fi: Tämä on myymälän tuotesivun sivupalkki kaikille asetteluille.
sv_se: Detta är sidopanelen för butiksproduktsidan för alla layouter.

source: Shop Category Page Sidebar
fi: Kaupan luokkasivun sivupalkki
sv_se: Butikskategori Sidofält

source: This is the shop category page sidebar for all layouts.
fi: Tämä on myymäläsivun sivupalkki kaikille asetteluille.
sv_se: Detta är sidofältet för butikskategorisidan för alla layouter.

source: Shop Cart & Checkout Page Sidebar
fi: Ostoskori ja kassasivun sivupalkki
sv_se: Handla kundvagn och kassasida Sidofält

source: This is the shop cart & checkout page sidebar for all layouts.
fi: Tämä on ostoskorin ja kassasivun sivupalkki kaikille asetteluille.
sv_se: Detta är butiksvagnens och kassans sidofält för alla layouter.

source: Shop Account Page Sidebar
fi: Kauppatilin sivupalkki
sv_se: Sidofält för shopparkontosida

source: This is the shop account page sidebar for all layouts.
fi: Tämä on kauppatilin sivupalkki kaikille asetteluille.
sv_se: Detta är sidofältet för butikskontosidan för alla layouter.

source: my-account
fi: tilini
sv_se: mitt-konto

# Next post
source: Next
fi: Seuraava
sv_se: Nästa

# Previous post
source: Previous
fi: Edellinen
sv_se: Tidigare

source: PHP version <strong>%1$s</strong> is required You are using <strong>%2$s</strong>. Please update or contact your hosting company.
fi: Vaaditaan PHP-versio <strong>%1$s</strong> Käytät <strong>%2$s</strong>. Päivitä tai ota yhteyttä hosting-yritykseesi.
sv_se: PHP-version <strong>%1$s </strong> krävs Du använder <strong>%2$s</strong>. Vänligen uppdatera eller kontakta ditt webbhotell.

source: iPress requires at least WordPress version %1$s. You are running version %2$s.
fi: iPress vaatii ainakin WordPress-version %1$s. Käytät versiota %2$s.
sv_se: iPress kräver minst WordPress-version %1$s. Du kör version %2$s.

source: iPress Child Theme is active. This theme is intended for standalone use.
fi: iPress Child -teema on aktiivinen. Tämä teema on tarkoitettu itsenäiseen käyttöön.
sv_se: iPress Child Theme är aktivt. Detta tema är avsett för fristående användning.

source: Add New
fi: Lisää uusi
sv_se: Lägg till ny

source: Add New %s
fi: Lisää uusi %s
sv_se: Lägg till ny %s

source: Edit %s
fi: Muokata %s
sv_se: Redigera %s

source: Update %s
fi: Päivittää %s
sv_se: Uppdatering %s

source: New %s
fi: Uusi %s
sv_se: Ny %s

source: View %s
fi: Näkymä %s
sv_se: Se %s

source: Search %s
fi: Hae %s
sv_se: Sök %s

source: No %s found
fi: %s ei löytynyt
sv_se: Inga %s hittades

source: No %s found in Trash
fi: Roskakorista ei löytynyt %s
sv_se: Inga %s hittades i papperskorgen

source: Parent %s:
fi: Vanhempi %s:
sv_se: Förälder %s:

source: All %s
fi: Kaikki %s
sv_se: Alla %s

source: %s Archives
fi: %s Arkisto
sv_se: %s Arkiv

source: %s Attributes
fi: %s Määritteet
sv_se: %s Attribut

source: Insert into %s
fi: Laittaa sisään %s
sv_se: Sätt i %s

source: Uploaded to this %s
fi: Ladattu tähän %s
sv_se: Laddat upp till detta %s

source: %s Featured Image
fi: %s Esitelty kuva
sv_se: %s Utvald bild

source: Set %s Featured Image
fi: Aseta esitelty kuva %s
sv_se: Ställ in %s Utvald bild

source: Remove %s Featured Image
fi: Poista %s esitelty kuva
sv_se: Ta bort %s Utvald bild

source: Use %s Featured Image
fi: Käytä esiteltyä kuvaa %s
sv_se: Använd %s Utvald bild

source: Filter %s list
fi: Suodata %s luettelo
sv_se: Filtrera %s-lista

source: %s list
fi: %s lista
sv_se: %s lista

source: %s list navigation
fi: %s luettelonavigointi
sv_se: %s lista navigering

source: %s published
fi: %s julkaistu
sv_se: %s publicerat

source: %s published privately
fi: %s julkaistu yksityisesti
sv_se: %s publiceras privat

source: %s reverted to draft
fi: %s palautettu luonnokseen
sv_se: %s återgått till utkast

source: %s scheduled
fi: %s suunniteltu
sv_se: %s planerad

source: %s updated
fi: %s päivitetty
sv_se: %s uppdaterad

source: This is the %s post-type
fi: Tämä on %s jälkityyppi
sv_se: Detta är %s posttyp

source: New %s Name
fi: Uusi %s nimi
sv_se: Nytt %s namn

source: Parent %s
fi: Vanhempi%s
sv_se: Förälder %s

source: Popular %s
fi: Suosittu %s
sv_se: Populära %s

source: &#8617; Back to %s
fi: &#8617; Takaisin %s
sv_se: &#8617; Tillbaka till %s

source: Separate %s with commas
fi: Erota %s pilkuilla
sv_se: Separera %s med komma-tecken

source: Add or remove %s
fi: Lisää tai poista %s
sv_se: Lägg till eller ta bort %s

source: Choose from the most used %s
fi: Valitse eniten käytetyistä %s
sv_se: Välj bland de mest använda %s

source: This is the %s taxonomy
fi: Tämä on %s taksonomia
sv_se: Detta är %s taxonomi

source: Show All %s
fi: Näytä kaikki %s
sv_se: Visa alla %s

source: Error: Bad Post Types [%s].
fi: Virhe: Huonot postityypit [%s].
sv_se: Fel: Dåliga inläggstyper [%s].

source: Error: Bad Taxonomies [%s].
fi: Virhe: Huonot taksonomiat [%s].
sv_se: Fel: Dåliga taxonomier [%s].

source: Background
fi: Tausta
sv_se: Bakgrund

source: Header
fi: Ylätunniste
sv_se: Rubrik

source: Footer
fi: Alatunniste
sv_se: Sidfot

source: Footer content
fi: Alatunnisteen sisältö
sv_se: Sidfotens innehåll

source: Display Site Title & Tagline
fi: Näytä sivuston otsikko ja tunnuslause
sv_se: Visa webbplatsens titel och slagord

source: Additional JS
fi: LisäJS
sv_se: Ytterligare JS

source: Add custom header & footer js.
fi: Lisää mukautettu otsikko ja alatunniste js.
sv_se: Lägg till anpassat sidhuvud och sidfot js.

source: Custom header JS
fi: Muokattu otsikon js
sv_se: Anpassat header-JS

source: Custom inline header js. Exclude <script></script> tag.
fi: Muokattu rivin otsikko js. Sulje pois <script></script> -tagi.
sv_se: Anpassat inline-header-js. Uteslut taggen <script> </script>.

source: Custom footer JS
fi: Mukautettu alatunniste js
sv_se: Anpassad sidfot JS

source: Custom inline footer js. Exclude <script></script> tag.
fi: Mukautettu rivien alatunniste js. Sulje pois <script></script> -tagi.
sv_se: Anpassad fotfot js. Uteslut taggen <script></script>.

source: Custom admin header JS
fi: Muokattu järjestelmänvalvojan otsikot JS
sv_se: Anpassat admin-header-JS

source: Custom inline admin header js. Exclude <script></script> tag.
fi: Muokattu sisäänrakennettu järjestelmänvalvojan otsikko js. Sulje pois <script></script> -tagi.
sv_se: Anpassat inline admin header js. Uteslut taggen <script></script>.

source: Custom admin footer JS
fi: Mukautettu järjestelmänvalvojan alatunniste JS
sv_se: Anpassat admin-sidfot-JS

source: Custom inline admin footer js. Exclude <script></script> tag.
fi: Mukautettu sisäinen järjestelmänvalvojan alatunniste js. Sulje pois <script> </script> -tagi.
sv_se: Anpassat inline admin sidfot js. Uteslut taggen <script></script>.

source: Theme
fi: Teema
sv_se: Tema

source: Add theme specific settings.
fi: Lisää teemakohtaiset asetukset.
sv_se: Lägg till temaspecifika inställningar.

source: Breadcrumbs
fi: Leivänmuruja
sv_se: Ströbröd

source: Display or hide the inner page breadcrumbs.
fi: Näytä tai piilota sisäsivun leivänmuru.
sv_se: Visa eller dölj brödsmulor på insidan.

source: Hero
fi: Sankari
sv_se: Hjälte

source: Front page hero image and details
fi: Etusivun sankarikuva ja yksityiskohdat
sv_se: Första sidan hjälte bild och detaljer

source: Front Page Hero Area
fi: Etusivun sankarialue
sv_se: Första sidan hjälteområdet

source: Display or hide the front page hero section.
fi: Näytä tai piilota etusivun sankariosa.
sv_se: Visa eller dölj startsidan för hjälte.

source: Hero Title
fi: Hero otsikko
sv_se: Hjälttitel

source: Modify the front page hero section title
fi: Muokkaa etusivun sankariosan otsikkoa
sv_se: Ändra titeln på hjältesektionen på första sidan

source: Hero Description
fi: Hero kuvaus
sv_se: Hjälte beskrivning

source: Modify the front page hero section description
fi: Muokkaa etusivun sankariosan kuvausta
sv_se: Ändra beskrivningen av hjältesektionen på första sidan

source: Button Page Link
fi: Nappisivulinkki
sv_se: Länk till knappsida

source: Link to page via button
fi: Linkki sivulle painikkeella
sv_se: Länk till sidan via knappen

source: Learn More
fi: Lisätietoja
sv_se: Lära sig mer

source: Hero Button Text
fi: Hero-painikkeen teksti
sv_se: Hjälteknapptext

source: Hero button text
fi: Hero-painikkeen teksti
sv_se: Hjälteknapptext

source: Hero Image
fi: Sankarikuva
sv_se: Hjältebild

source: Add the hero section background image
fi: Lisää sankariosan taustakuva
sv_se: Lägg till bakgrundsbilden på hjältesektionen

source: Hero Background Color
fi: Hero taustaväri
sv_se: Hjälta bakgrundsfärg

source: Hero background color
fi: Hero taustaväri
sv_se: Hjälta bakgrundsfärg

source: Hero Overlay
fi: Sankarin peittokuva
sv_se: Hjälten överlägg

source: Display an overlay with opacity on the hero image.
fi: Näytä sankarikuvan peittokuva, jossa on läpinäkymättömyys.
sv_se: Visa en överlägg med opacitet på hjältebilden.

source: Hero Overlay Color
fi: Hero-peittoväri
sv_se: Heltoverlay färg

source: Hero overlay color
fi: Hero-peittoväri
sv_se: Heltoverlay färg

source: Value must be between 0 and 100
fi: Arvon on oltava välillä 0 – 100
sv_se: Värdet måste vara mellan 0 och 100

source: Hero Overlay Opacity
fi: Sankarin peittokuva läpinäkyvyys
sv_se: Heltöverdragsopacitet

source: Hero overlay opacity
fi: Sankarin peittokuva läpinäkyvyys
sv_se: Heltöverdragsopacitet

source: Comma separated list of category IDs only.
fi: Pilkulla erotettu luettelo vain luokkatunnuksista.
sv_se: Kommaseparerad lista med endast kategori-ID.

source: Admin Phone No.
fi: Järjestelmänvalvojan puhelinnumero
sv_se: Administratörs telefonnummer.

source: Small
fi: Pieni
sv_se: Små

source: Normal
fi: Normaali
sv_se: Vanligt

source: Medium
fi: Keskikokoinen

source: Large
fi: Suuri
sv_se: Stor

source: Big
fi: Iso
sv_se: Väldigt stor

source: <strong>ERROR</strong>: Stop guessing!
fi: <strong>VIRHE</strong>:Lopeta arvaaminen!
sv_se: <strong>FEL</strong>: Sluta gissa!

source: Footer %d
fi: Alatunniste %d
sv_se: Sidfot %d

source: Footer sidebar area %d.
fi: Alatunnisteen sivupalkin alue %d.
sv_se: Sidfältets sidfält %d.

source: This is the %s sidebar description
fi: Tämä on %s sivupalkin kuvaus
sv_se: Detta är %s sidofältbeskrivning

source: &larr; Older
fi: &larr; Vanhemmat
sv_se: &larr; Äldre

source: Newer &rarr;
fi: Uudemmat&rarr;
sv_se: Nyare &rarr;

source: Next post
fi: Seuraava viesti
sv_se: Nästa inlägg

source: Previous post
fi: Edellinen viesti
sv_se: Tidigare inlägg

source: Prev
fi: Edellinen
sv_se: Föregående

source: Next
fi: Seuraava
sv_se: Nästa

source: Previous Page
fi: Edellinen sivu
sv_se: Föregående sida

source: Next Page
fi: Seuraava sivu
sv_se: Nästa sida

source: Theme Requires WooCommerce %1$s. Version %2$s installed
fi: Teema vaatii WooCommerce %1$s. Versio %2$s asennettu
sv_se: Tema kräver Woocommerce %1$s. Version %2$s installerad

source: Posted on
fi: Lähetetty
sv_se: Inlagd i

source: Posted on <a href="%1$s" rel="bookmark">%2$s</a>
fi: Lähetetty <a href="%1$s" rel="bookmark">%2$s</a>
sv_se: Publicerat den <a href="%1$s" rel="bookmark">%2$s</a>

source: By <span class="post-author"><a href="%1$s" class="post-author-link" rel="author"><span class="post-author-name">%2$s</span></a></span>
fi: Mennessä <span class="post-author"><a href="%1$s" class="post-author-link" rel="author"><span class="post-author-name">%2$s</span></a></span>

source: Edit <span class="screen-reader-text">"%s"</span>
fi: Muokata <span class="screen-reader-text">"%s"</span>
sv_se: Redigera <span class="screen-reader-text">%s</span>

source: Written by
fi: Kirjoittanut
sv_se: Skriven av

source: Posted in
fi: Lähetetty
sv_se: Inlagd i

source: Tagged in
fi: Merkitty
sv_se: Taggad i

source: WooCommerce Shop Page
fi: WooCommerce-kaupan sivu
sv_se: WooCommerce butikssida

source: WooCommerce Cart Page
fi: WooCommercen ostoskorisivu
sv_se: WooCommerce kundvagnssida

source: WooCommerce Checkout Page
fi: WooCommerce Checkout -sivu
sv_se: WooCommerce kassasida

source: WooCommerce Account Page
fi: WooCommerce-tilisivu
sv_se: WooCommerce-kontosida

source: Sample Section
fi: Näyteosa
sv_se: Provetikett

source: Sample Label
fi: Näytteen etiketti
sv_se: Provetikett

source: Add theme specific Woocommerce settings.
fi: Lisää teemakohtaiset Woocommerce-asetukset.
sv_se: Lägg till temaspecifika Woocommerce-inställningar.

source: Display or hide the store pages breadcrumbs.
fi: Näytä tai piilota kaupan sivujen leivänmuru.
sv_se: Visa eller dölj brödsmulor på butikssidorna.

source: Product Pagination
fi: Tuotteen sivutus
sv_se: Produktpaginering

source: Displays next and previous links on product pages. Hover reveals product details & thumbnail.
fi: Näyttää seuraavan ja edellisen linkin tuotesivuilla. Hover paljastaa tuotetiedot ja pikkukuvan.
sv_se: Visar nästa och föregående länkar på produktsidor. Hover avslöjar produktinformation och miniatyrbild.

source: Product Search
fi: Tuotehaku
sv_se: Produktsökning

source: Displays header product search box.
fi: Näyttää otsikon tuotehakukentän.
sv_se: Visar sökrutan för rubrikprodukt.

source: Add to basket
fi: Lisää ostoskoriin
sv_se: Lägg i korgen

source: Read more
fi: Lue lisää
sv_se: Läs mer

source: Select options
fi: Valitse vaihtoehdot
sv_se: Välj inställningar

source: View products
fi: Näytä tuotteet
sv_se: Visa produkter

# placeholder
source: Buy product
fi: Osta tuote
sv_se: Köp produkt

source: Random
fi: Satunnainen
sv_se: Slumpmässig

source: Orders
fi: Tilaukset
sv_se: Beställningar

source: Total Spent
fi: Yhteensä Käytetty
sv_se: Totalt Spenderat

source: Shop by Category
fi: Osta luokittain
sv_se: Handla efter kategori

source: Product Categories
fi: Tuoteryhmät
sv_se: Produktkategori

source: New Products
fi: Uudet tuotteet
sv_se: Nya produkter

source: Recent Products
fi: Viimeisimmät tuotteet
sv_se: Nya produkter

source: We Recommend
fi: Suosittelemme
sv_se: Vi rekommenderar

source: Featured Products
fi: Esittelyssä olevat tuotteet
sv_se: Utvalda produkter

source: Popular Products
fi: Suositut tuotteet
sv_se: Populära produkter

source: On Sale
fi: Alennuksessa
sv_se: Till salu

source: On Sale Products
fi: Myynnissä olevat tuotteet
sv_se: Till salu produkter

source: Best Sellers
fi: Myydyimmät
sv_se: Bästsäljare

source: Best Selling Products
fi: Myydyimmät tuotteet
sv_se: Bästsäljande produkter

source: Edit <span class="screen-reader-text">%s</span>
fi: Muokata <span class="screen-reader-text">"%s"</span>
sv_se: Redigera <span class="screen-reader-text">%s</span>

source: Oops! That page can&rsquo;t be found.
fi: Oho! Sivua ei löydy.
sv_se: Hoppsan! Den sidan kan inte hittas.

source: Return home?
fi: Palata kotiin?
sv_se: Återvända hem?

source: Nothing found at this location.
fi: Mitään ei löydy tästä paikasta.
sv_se: Ingenting hittades på den här platsen.

source: Nothing to display.
fi: Ei näytettävää.
sv_se: Inget att visa.

source: Ready to publish your first post? <a href="%1$s">Get started here</a>.
fi: Oletko valmis julkaisemaan ensimmäisen viestisi? <a href="%1$s">Aloita täältä</a>.
sv_se: Är du redo att publicera ditt första inlägg? <a href="%1$s">Kom igång här</a>.

source: Sorry, nothing matched your search terms. Please try again with different keywords.
fi: Valitettavasti mikään ei vastannut hakutermejäsi. Yritä uudelleen eri avainsanoilla.
sv_se: Tyvärr, ingenting matchade dina söktermer. Försök igen med olika sökord.

source: We can&rsquo;t find what you&rsquo;re looking for. Perhaps searching can help.
fi: Emme löydä etsimääsi. Ehkä etsiminen voi auttaa.
sv_se: Vi kan inte hitta det du letar efter. Kanske kan sökning hjälpa.

source: loading...
fi: ladataan...
sv_se: läser in...

source: Skip to navigation
fi: Siirry navigointiin
sv_se: Hoppa till navigering

source: Skip to content
fi: Siirry sisältöön
sv_se: Hoppa till innehåll

source: Home
fi: Koti
sv_se: Hem

source: Archive
fi: Arkisto
sv_se: Arkiv

source: Author
fi: Kirjailija
sv_se: Författare

source: Category
fi: Kategoria
sv_se: Kategori

source: Search
fi: Hae
sv_se: Sök

source: Tag
fi: Lappu
sv_se: Märka

# post format archive title
source: Galleries
fi: Galleriat
sv_se: Gallerier

# post format archive title
source: Images
fi: Kuvat
sv_se: Bilder

# post format archive title
source: Videos
fi: Videot
sv_se: Videoklipp

# post format archive title
source: Quotes
fi: Lainausmerkit
sv_se: Citat

# post format archive title
source: Links
fi: Linkit
sv_se: Länkar

# post format archive title
source: Statuses
fi: Tilat
sv_se: Status

# post format archive title
source: Chats
fi: Chatit
sv_se: Chattar

source: Theme %1$s by %2$s.
fi: Teema %1$s kirjoittanut %2$s.
sv_se: Tema %1$s av %2$s.

source: Primary Navigation
fi: Ensisijainen navigointi
sv_se: Primärnavigering

source: Menu
fi: Valikko
sv_se: Meny

source: Continue reading %s
fi: Jatka %s lukemista
sv_se: Fortsätt läsa %s

source: Pages:
fi: Sivut:
sv_se: Sidor:

# post
source: Featured
fi: Kiinnostavat
sv_se: Dagens

source: By <a href="%1$s" class="post-author-link" rel="author"><span class="post-author-name">%2$s</span></a>
fi: Mennessä <span class="post-author"><a href="%1$s" class="post-author-link" rel="author"><span class="post-author-name">%2$s</span></a></span>
sv_se: By <span class="post-author"><a href="%1$s" class="post-author-link" rel="author"><span class="post-author-name">%2$s</span></a></span>

source: View your basket
fi: Näytä korisi
sv_se: Se din korg

source: No Woocommerce Breadcrumb for this type [%s] yet!
fi: Tälle tyypille ei vielä ole Woocommerce-leipää [% s]!
sv_se: Ingen Woocommerce Breadcrumb för den här typen [%s] än!

source: %s quantity
fi: %s määrä
sv_se: %s antal

source: Quantity
fi: Määrä
sv_se: Antal

# Product quantity input tooltip
source: Qty
fi: Määrä
sv_se: Antal

source: Account
fi: Tili
sv_se: Konto

source: More products
fi: Lisää tuotteita
sv_se: Fler produkter

source: Display Previous Product
fi: Näytä edellinen tuote
sv_se: Visa tidigare produkt

source: Display Next Product
fi: Näytä seuraava tuote
sv_se: Visa nästa produkt

source: Current page
sv_se: Nuvarande sida
